Revit 2025 API
ElectricalSystem.WireSizeString Property
 The WireSize as a String of the Electrical System
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public string WireSizeString { get; }
Public ReadOnly Property WireSizeString As String
	Get
public:
property String^ WireSizeString {
	String^ get ();
}
member WireSizeString : string with get
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the WireSize String of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace